cloud/kubernetes/tutorial.org
#+TITLE: Notes On [[https://kubernetes.io/docs/tutorials/][Kubernetes Tutorial]]
#+AUTHOR: Zhao WenBin

* Basic
** Cluster Structure

*** Explain k8s in one sentence

 Kubernetes is a production-grade, open-source platform that orchestrates the
 placement (scheduling) and execution of application containers within and
 across computer clusters.

*** Master and nodes

 Masters manage the cluster and the nodes are used to host the running applications
 - Kubernetes cluster runs containerized application which is not
   dependent to host environment
 - There's process named =kubelet= running on each node which will
   communicate with master and operate to local virtual infrastructure
   (docker/rkt/...)

*** TODO cluster-interactive

 google doc can not been seen
** Deploy an App

*** Basic

 A Deployment is responsible for creating and updating instances of your application

*** Container Backend
    
 Applications need to be packaged into one of the supported container formats in order to be deployed on Kubernetes.

*** Note

 - =kubectl= is a command line tools, which interactive with server use API. Similar to =beeline= for hive
 - After deployment, deployment controller is responsible for self-healing and recover from failure
 - Kubernetes provides extra features such as *scale* and *update*

*** TODO Interactive

 Google doc can not been seen...

 - ~kubectl run --image=... --port=...~ to make a new deployment
 - ~kubectl get deployment~ to see the deployment
 - Can also see running process with ~kubectl get pod~
 - ~kubectl proxy~ to forward http request to inner-cluster network

** Explore Your App

*** Pods

 A Pod is a group of one or more application containers( such as Docker or rkt) and 
 includes shared storage (volumes), IP Address and information about how to run them.

 Containers in pod are relatively tightly coupled, they would be co-located and co-scheduled,
 and have shared context.

 The Pod will be act as a atomic unit and *always* run on a single Node.

*** Note


- A Pod always runs on a Node. (for shared context maybe?)
- Multiple Pods can run on one Node
- Every node runs at least a kubelet and a container runtime (like Docker, rkt)
- Containers should only be scheduled together in a single Pod if they
  are tightly coupled and need to share resource such as disk

**** TODO Interactive

 Google doc can not be seen...

** Expose Your App Publicly

User =services= to expose application services in Pod.

A Kubernetes Service is an abstraction layer which defines a logical
set of Pods and enables external traffic exposure, load balancing and
service discovery for those Pods.

Service filters pod with labels attach to it:
- =kubectl get= has option =-l= to select label
- ~kubectl label pod <pod-name> key=value~ to set label

*** TODO Best Practice

You can create a Service at the same time you create a Deplyment by using *=--expose=* in kubectl
#+BEGIN_SRC bash
  kubectl expose deployment/kubernetes-bootcamp --type="NodePort" --port 8080
#+END_SRC

- what's the mean of =deployment=?
- NAT forward 8080 port to other port with internal IP

*** Services Type

- ClusterIP: internal IP
- NodePort: NAT
- LoadBalancer: external IP
- ExternalName: CNAME (with *kube-dns*?)

*** Delete Service

- Use ~kubectl delete service -l <label-selector>~ to delete service
- After service was deleted, the Pod is running 

*** TODO Note

 Google Docs can not been seen...

 - Pod has lifecycle, can be died (when node failed?).
 - =ReplicationController= will create new Pod for recovery from failure automatically
 - Service proxy/expose request to multiple Pod, and also provide route traffic functional
 - Pods with the same =Label= can be found by =LabelSelector=
 - Use =kubectl get servies= list the current Services

*** TODO Future Read

- [[https://kubernetes.io/docs/tutorials/services/source-ip/][Using Source IP]]
- [[https://kubernetes.io/docs/concepts/services-networking/connect-applications-service][Connecting Applications with Services]]

** Scale Your App

*** =kubectl scale= command

 #+BEGIN_SRC bash
   kubectl scale deployments/kubernetes-bootcamp --replicas=4
 #+END_SRC

 - The scaled Pods has difference IP address (can be check by =kubectl get pods -o wide=)
 - Request to service will be route to different Pods
 - Count of replica can be reduce, some Pods will be terminated.

*** TODO Note

 Google docs can not been seen...

 - Deploy with multiple instance using =-replicas= parameters
 - Duplicated Pods will be created
 - Service will route traffic to different Pods for performance
 - Monitor endpoint(?) to ensure the traffic is sent only to available Pods.
 - Can be used for Rolling Update
 - How to keep the consistent of data?

