kubernetes/tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-09-13 四 20:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Notes On <a href="https://kubernetes.io/docs/tutorials/">Kubernetes Tutorial</a></title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Notes On <a href="https://kubernetes.io/docs/tutorials/">Kubernetes Tutorial</a></h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9238e6f">Learn Kubernetes Basic</a></li>
<li><a href="#orgd7e5812">Configuration</a></li>
<li><a href="#orge7698c7">Useful commands</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org9238e6f" class="outline-2">
<h2 id="org9238e6f">Learn Kubernetes Basic</h2>
<div class="outline-text-2" id="text-org9238e6f">
</div><div id="outline-container-org8d26348" class="outline-3">
<h3 id="org8d26348">Cluster Structure</h3>
<div class="outline-text-3" id="text-org8d26348">
</div><div id="outline-container-orgba3e158" class="outline-4">
<h4 id="orgba3e158">What is kubernets cluster</h4>
<div class="outline-text-4" id="text-orgba3e158">
<p>
Kubernetes is a production-grade, open-source platform that orchestrates the
placement (scheduling) and execution of application containers within and
across computer clusters.
</p>
</div>
</div>

<div id="outline-container-org78b5367" class="outline-4">
<h4 id="org78b5367">Master and nodes</h4>
<div class="outline-text-4" id="text-org78b5367">
<p>
Masters manage the cluster and the nodes are used to host the running applications
</p>
</div>
</div>

<div id="outline-container-orge713c34" class="outline-4">
<h4 id="orge713c34">Note</h4>
<div class="outline-text-4" id="text-orge713c34">
<ul class="org-ul">
<li>Kubernetes cluster 中运行的是 containerized (容器化的) application，意味着应用不假设于 host 环境</li>
<li>node 中运行有 kubelet 与 master 交互，并可以对本地的 docker 或 rkt 环境进行操作</li>
</ul>
</div>
</div>
<div id="outline-container-org478aa49" class="outline-4">
<h4 id="org478aa49"><span class="todo TODO">TODO</span> cluster-interactive</h4>
<div class="outline-text-4" id="text-org478aa49">
<p>
google doc can not been seen
</p>
</div>
</div>
</div>
<div id="outline-container-org4da1465" class="outline-3">
<h3 id="org4da1465">Deploy an App</h3>
<div class="outline-text-3" id="text-org4da1465">
</div><div id="outline-container-org4e77c1a" class="outline-4">
<h4 id="org4e77c1a">Deployment Basic</h4>
<div class="outline-text-4" id="text-org4e77c1a">
<p>
A Deployment is responsible for creating and updating instances of your application
</p>
</div>
</div>

<div id="outline-container-orgebb69e6" class="outline-4">
<h4 id="orgebb69e6">Container Backend</h4>
<div class="outline-text-4" id="text-orgebb69e6">
<p>
Applications need to be packaged into one of the supported container formats in order to be deployed on Kubernetes.
</p>
</div>
</div>

<div id="outline-container-org36e0f60" class="outline-4">
<h4 id="org36e0f60">Note</h4>
<div class="outline-text-4" id="text-org36e0f60">
<ul class="org-ul">
<li><code>kubectl</code> is a command line tools, which interactive with server use API. Just like beeline with hive</li>
<li>After deployment, deployment controller is responsible for self-healing and recover from failure</li>
<li>Kubernetes provides extra features such as <b>scale</b> and <b>update</b></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb35806" class="outline-4">
<h4 id="orgcb35806"><span class="todo TODO">TODO</span> Interactive</h4>
<div class="outline-text-4" id="text-orgcb35806">
<p>
Google doc can not been seen&#x2026;
</p>

<ul class="org-ul">
<li><code>kubectl run --image=... --port=...</code> to make a new deployment</li>
<li><code>kubectl get deployment</code> to see the deployment</li>
<li>Can also see running process with <code>kubectl get pod</code></li>
<li><code>kubectl proxy</code> to forward http request to inner-cluster network</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4bbab06" class="outline-3">
<h3 id="org4bbab06">Explore Your App</h3>
<div class="outline-text-3" id="text-org4bbab06">
</div><div id="outline-container-org5013f24" class="outline-4">
<h4 id="org5013f24">Pods</h4>
<div class="outline-text-4" id="text-org5013f24">
<p>
A Pod is a group of one or more application containers( such as Docker or rkt) and 
includes shared storage (volumes), IP Address and information about how to run them.
</p>

<p>
Containers in pod are relatively tightly coupled, they would be co-located and co-scheduled,
and have shared context.
</p>

<p>
The Pod will be act as a atomic unit and <b>always</b> run on a single Node.
</p>
</div>
</div>

<div id="outline-container-org6274bd0" class="outline-4">
<h4 id="org6274bd0">Nodes</h4>
<div class="outline-text-4" id="text-org6274bd0">
</div><ul class="org-ul"><li><a id="orgc6acaa1"></a>best practice<br><div class="outline-text-5" id="text-orgc6acaa1">
<p>
Containers should only be scheduled together in a single Pod if they are tightly coupled and need to share resource such as disk.
</p>
</div></li>

<li><a id="org54129b9"></a>note<br><div class="outline-text-5" id="text-org54129b9">
<ul class="org-ul">
<li>A Pod always runs on a Node. (for shared context maybe?)</li>
<li>Multiple Pods can run on one Node.</li>
<li>Every node runs at least a kubelet and a container runtime (like Docker, rkt)</li>
</ul>
</div></li>

<li><a id="org4fbf82a"></a><span class="todo TODO">TODO</span> Interactive<br><div class="outline-text-5" id="text-org4fbf82a">
<p>
Google doc can not be seen&#x2026;
</p>
</div></li></ul>
</div>
</div>

<div id="outline-container-org96fee06" class="outline-3">
<h3 id="org96fee06">Expose Your App Publicly</h3>
<div class="outline-text-3" id="text-org96fee06">
</div><div id="outline-container-org403277e" class="outline-4">
<h4 id="org403277e">Service</h4>
<div class="outline-text-4" id="text-org403277e">
</div><ul class="org-ul"><li><a id="orgee3a006"></a>Definition<br><div class="outline-text-5" id="text-orgee3a006">
<p>
A Kubernetes Service is an abstraction layer which defines a logical set of Pods 
and enables external traffic exposure, load balancing and service discovery for those Pods.
</p>
</div></li>

<li><a id="org357757a"></a>Best Practice<br><div class="outline-text-5" id="text-org357757a">
<p>
You can create a Service at the same time you create a Deplyment by using <b><code>--expose</code></b> in kubectl
</p>
</div></li>

<li><a id="orgbd2582e"></a><span class="todo TODO">TODO</span> <code>type</code> in ServiceSpec<br><div class="outline-text-5" id="text-orgbd2582e">
<ul class="org-ul">
<li>ClusterIP: internal IP</li>
<li>NodePort: NAT</li>
<li>LoadBalancer: external IP</li>
<li>ExternalName: CNAME (with <b>kube-dns</b>?)</li>
</ul>
</div></li>

<li><a id="orgedce726"></a><span class="todo TODO">TODO</span> Create Service with <code>expose</code><br><div class="outline-text-5" id="text-orgedce726">
<div class="org-src-container">
<pre class="src src-bash">kubectl expose deployment/kubernetes-bootcamp --type="NodePort" --port 8080
</pre>
</div>

<ul class="org-ul">
<li>what's the mean of <code>deployment</code>?</li>
<li>NAT forward 8080 port to other port with internal IP</li>
</ul>
</div></li>

<li><a id="org6cde2d2"></a>Mark Pod with Label<br><div class="outline-text-5" id="text-org6cde2d2">
<ul class="org-ul">
<li><code>kubectl get</code> has option <code>-l</code> to select label</li>
<li><code>kubectl label pod &lt;pod-name&gt; key=value</code> to set label</li>
</ul>
</div></li>

<li><a id="orgb393054"></a>Delete Service<br><div class="outline-text-5" id="text-orgb393054">
<ul class="org-ul">
<li>Use <code>kubectl delete service -l &lt;label-selector&gt;</code> to delete service</li>
<li>After service was deleted, the Pod is running</li>
</ul>
</div></li>

<li><a id="orgf269970"></a><span class="todo TODO">TODO</span> Note<br><div class="outline-text-5" id="text-orgf269970">
<p>
Google Docs can not been seen&#x2026;
</p>

<ul class="org-ul">
<li>Pod has lifecycle, can be died (when node failed?).</li>
<li><code>ReplicationController</code> will create new Pod for recovery from failure automatically</li>
<li>Service proxy/expose request to multiple Pod, and also provide route traffic functional</li>
<li>Pods with the same <code>Label</code> can be found by <code>LabelSelector</code></li>
<li>Use <code>kubectl get servies</code> list the current Services</li>
</ul>
</div></li>

<li><a id="orgc8a3de8"></a>Future Read<br><div class="outline-text-5" id="text-orgc8a3de8">
<ul class="org-ul">
<li><a href="https://kubernetes.io/docs/tutorials/services/source-ip/">Using Source IP</a></li>
<li><a href="https://kubernetes.io/docs/concepts/services-networking/connect-applications-service">Connecting Applications with Services</a></li>
</ul>
</div></li></ul>
</div>
</div>

<div id="outline-container-org2f630ca" class="outline-3">
<h3 id="org2f630ca">Scale Your App</h3>
<div class="outline-text-3" id="text-org2f630ca">
</div><div id="outline-container-org756def5" class="outline-4">
<h4 id="org756def5"><code>kubectl scale</code> command</h4>
<div class="outline-text-4" id="text-org756def5">
<div class="org-src-container">
<pre class="src src-bash">kubectl scale deployments/kubernetes-bootcamp --replicas=4
</pre>
</div>

<ul class="org-ul">
<li>The scaled Pods has difference IP address (can be check by <code>kubectl get pods -o wide</code>)</li>
<li>Request to service will be route to different Pods</li>
<li>Count of replica can be reduce, some Pods will be terminated.</li>
</ul>
</div>
</div>

<div id="outline-container-orga760898" class="outline-4">
<h4 id="orga760898"><span class="todo TODO">TODO</span> Note</h4>
<div class="outline-text-4" id="text-orga760898">
<p>
Google docs can not been seen&#x2026;
</p>

<ul class="org-ul">
<li>Deploy with multiple instance using <code>-replicas</code> parameters</li>
<li>Duplicated Pods will be created</li>
<li>Service will route traffic to different Pods for performance</li>
<li>Monitor endpoint(?) to ensure the traffic is sent only to available Pods.</li>
<li>Can be used for Rolling Update</li>
<li>How to keep the consistent of data?</li>
</ul>
</div>
</div>
</div>
