cloud/kubernetes/tutorial.org
** Update Your App

Rolling updates allow Deployments' update to take place with zero
downtime by incrementally updating Pods instances with new ones

If a Deployment is exposed publicly, the Service will load-balance the
traffic only to available Pods during the update

*** TODO Usage

Google docs can not been seen...

*** Update Deployment's image

 use =set image= command change image (specific deployment and new image)

 #+BEGIN_SRC bash
   kubectl set image deployments/kubernetes-bootcamp kubernetes-bootcamp=jocatalin/kubernetes-bootcamp:v2
 #+END_SRC

*** TODO Rollout Status

 #+BEGIN_SRC bash
   kubectl rollout status deployments/kubernetes-bootcamp
 #+END_SRC

*** TODO Revert

 #+BEGIN_SRC bash
   kubectl rollout undo deployments/kubernetes-bootcamp
 #+END_SRC

 - zero downtime rolling update with similar policy as scaling
 - update is versioned
 - can be reverted to previous version
 - useful for CI/CD (Integration/Delivery)

* Configuration

** Configuring Redis using a ConfigMap

*** Basic Step

1. create ConfigMap from local file
   #+BEGIN_SRC bash
     kubectl create configmap example-redis-config --from-file=redis-config
   #+END_SRC
2. check Configmap
   #+BEGIN_SRC bash
     kubectl get configmap example-redis-config -o yaml
   #+END_SRC
3. Use ConfigMap (dump configmap to mounted file) for Pod. The pod spec looks like:
   #+BEGIN_SRC yaml
     apiVersion: v1                  # version number
     kind: Pod
     metatdata:
       name: redis
     spec:
       containers:
       - name: redis                 # Container redis
         image: kubernetes/redis:v1  # Image
         env:                        # set environment variables
         - name: MASTER
           value: "true"
         ports:
         - containerPort: 6379
         resources:
           limits:
             cpu: "0.1"
         volumeMounts:
         - mountPath: /redis-master-data
           name: data                # mount Volume(data) to /redis-master-data
         - mountPath: /redis-master 
           name: config              # mount Volume(config) to /redis-master
       volumes:
         - name: data
           emptyDir: {}
         - name: config              # define new volume named `config`
           configMap:                # `configMap` is a type of volume
             name: example-redis-config # configMap name as identity
             items:
             - key: redis-config
               path: redis.conf      # configMap's path, will be mounted to `<mountPath>/redis.conf`
   #+END_SRC
*** Note

- ConfigMap is a config file
- Act as backend of Volume
- Can be mounted to Container as a file, which content is the ConfigMap settings

*** TODO Why use ConfigMap?

/ConfigMaps allow you to decouple configuration artifacts from image content to keep containerized applications portable./

Is there any backend to mount local file as a Volume to containers??

*** [[https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/][Configure a Pod to Use a ConfigMap]]

**** Overview 

- ConfigMap act as register table.
- Can be create from file, directory
- ConfigMap's value can be used by Pods as volume mount or command substitutioin

**** Create a ConfigMap

- use =kubectl create configmap <map-name> <data-source>= to create configmaps
- can based from directories, files or literal values
- parameters of ~--from-file~ can be directories or files
- ~--from-env-file~ can load property file's content
- ~--from-file~ can be formed as ~key=path~, key will be acted as =<path-to-file>=
- ~--from-literal~ can be passed multple times to specific key-value pairs

**** Define container environment variables using ConfigMap data

1. First create ConfigMap =special-config= with kv pair ~special.how=<value>~
2. Create Pod with settings looks like (env =SPECIAL_LEVEL_KEY= will be replaces with ConfigMap's =<value>= of ~special.how~)
   #+BEGIN_SRC yaml
     apiVersion: v1
     kind: Pod
     metadata:
       name: dapi-test-pod
     spec:
       containers:
         - name: test-container
           image: k8s.gcr.io/busybox
           command: [ "/bin/sh", "-c", "env" ]
           env:
             # Define the environment variable
             - name: SPECIAL_LEVEL_KEY
               valueFrom:
                 configMapKeyRef:
                   # The ConfigMap containing the value you want to assign to SPECIAL_LEVEL_KEY
                   name: special-config
                   # Specify the key associated with the value
                   key: special.how
       restartPolicy: Never
   #+END_SRC

**** Configure all key-value pairs in a ConfigMap as container environment variables

Use =envFrom= to define all of the ConfigMap's data as container environment variables
   
#+BEGIN_SRC yaml
  apiVersion: v1
  kind: Pod
  metadata:
    name: dapi-test-pod
  spec:
    containers:
      - name: test-container
        image: k8s.gcr.io/busybox
        command: [ "/bin/sh", "-c", "env" ]
        envFrom:
        - configMapRef:
            name: special-config
    restartPolicy: Never
#+END_SRC
   
**** Use ConfigMap-defined environment variables in Pod commands

Like shell variable substitutioin syntax, use =$(VAR_NAME)=. For example

#+BEGIN_SRC yaml
  apiVersion: v1
  kind: Pod
  metadata:
    name: dapi-test-pod
  spec:
    containers:
      - name: test-container
        image: k8s.gcr.io/busybox
        command: [ "/bin/sh", "-c", "echo $(SPECIAL_LEVEL_KEY) $(SPECIAL_TYPE_KEY)" ]
        env:
          - name: SPECIAL_LEVEL_KEY
            valueFrom:
              configMapKeyRef:
                name: special-config
                key: SPECIAL_LEVEL
          - name: SPECIAL_TYPE_KEY
            valueFrom:
              configMapKeyRef:
                name: special-config
                key: SPECIAL_TYPE
    restartPolicy: Never
#+END_SRC

