kubernetes/tutorial.html

<div id="outline-container-orgb30742b" class="outline-3">
<h3 id="orgb30742b">Update Your App</h3>
<div class="outline-text-3" id="text-orgb30742b">
</div><div id="outline-container-org1c957d9" class="outline-4">
<h4 id="org1c957d9">Digest</h4>
<div class="outline-text-4" id="text-org1c957d9">
<ul class="org-ul">
<li>Rolling updates allow Deployments' update to take place with zero downtime by incrementally updating Pods instances with new ones</li>
<li>If a Deployment is exposed publicly, the Service will load-balance the traffic only to available Pods during the update</li>
</ul>
</div>
</div>

<div id="outline-container-org7b4e82b" class="outline-4">
<h4 id="org7b4e82b">Note</h4>
</div>
<div id="outline-container-orgacde202" class="outline-4">
<h4 id="orgacde202"><span class="todo TODO">TODO</span> Usage</h4>
<div class="outline-text-4" id="text-orgacde202">
<p>
Google docs can not been seen&#x2026;
</p>
</div>

<ul class="org-ul"><li><a id="org382aab2"></a>Update Deployment's image<br><div class="outline-text-5" id="text-org382aab2">
<p>
use <code>set image</code> command change image (specific deployment and new image)
</p>

<div class="org-src-container">
<pre class="src src-bash">kubectl set image deployments/kubernetes-bootcamp kubernetes-bootcamp=jocatalin/kubernetes-bootcamp:v2
</pre>
</div>
</div></li>

<li><a id="org1a53c3b"></a>Rollout Status<br><div class="outline-text-5" id="text-org1a53c3b">
<div class="org-src-container">
<pre class="src src-bash">kubectl rollout status deployments/kubernetes-bootcamp
</pre>
</div>
</div></li>

<li><a id="org4a5ae7a"></a>Revert<br><div class="outline-text-5" id="text-org4a5ae7a">
<div class="org-src-container">
<pre class="src src-bash">kubectl rollout undo deployments/kubernetes-bootcamp
</pre>
</div>

<ul class="org-ul">
<li>zero downtime rolling update with similar policy as scaling</li>
<li>update is versioned</li>
<li>can be reverted to previous version</li>
<li>useful for CI/CD (Integration/Delivery)</li>
</ul>
</div></li></ul>
</div>
</div>
</div>

<div id="outline-container-orgd7e5812" class="outline-2">
<h2 id="orgd7e5812">Configuration</h2>
<div class="outline-text-2" id="text-orgd7e5812">
</div><div id="outline-container-org08d379d" class="outline-3">
<h3 id="org08d379d">Configuring Redis using a ConfigMap</h3>
<div class="outline-text-3" id="text-org08d379d">
</div><div id="outline-container-org7da05ba" class="outline-4">
<h4 id="org7da05ba">Basic Step</h4>
<div class="outline-text-4" id="text-org7da05ba">
<ol class="org-ol">
<li><p>
create ConfigMap from local file
</p>
<div class="org-src-container">
<pre class="src src-bash">kubectl create configmap example-redis-config --from-file=redis-config
</pre>
</div></li>
<li><p>
check Configmap
</p>
<div class="org-src-container">
<pre class="src src-bash">kubectl get configmap example-redis-config -o yaml
</pre>
</div></li>
<li><p>
Use ConfigMap (dump configmap to mounted file) for Pod. The pod spec looks like:
</p>
<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1                  # version number
kind: Pod
metatdata:
  name: redis
spec:
  containers:
  - name: redis                 # Container redis
    image: kubernetes/redis:v1  # Image
    env:                        # set environment variables
    - name: MASTER
      value: "true"
    ports:
    - containerPort: 6379
    resources:
      limits:
	cpu: "0.1"
    volumeMounts:
    - mountPath: /redis-master-data
      name: data                # mount Volume(data) to /redis-master-data
    - mountPath: /redis-master 
      name: config              # mount Volume(config) to /redis-master
  volumes:
    - name: data
      emptyDir: {}
    - name: config              # define new volume named `config`
      configMap:                # `configMap` is a type of volume
	name: example-redis-config # configMap name as identity
	items:
	- key: redis-config
	  path: redis.conf      # configMap's path, will be mounted to `&lt;mountPath&gt;/redis.conf`
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-org4acee21" class="outline-4">
<h4 id="org4acee21">Note</h4>
<div class="outline-text-4" id="text-org4acee21">
<ul class="org-ul">
<li>ConfigMap is a config file</li>
<li>Act as backend of Volume</li>
<li>Can be mounted to Container as a file, which content is the ConfigMap settings</li>
</ul>
</div>
</div>

<div id="outline-container-orgd156006" class="outline-4">
<h4 id="orgd156006"><span class="todo TODO">TODO</span> Why use ConfigMap?</h4>
<div class="outline-text-4" id="text-orgd156006">
<p>
<i>ConfigMaps allow you to decouple configuration artifacts from image content to keep containerized applications portable.</i>
</p>

<p>
Is there any backend to mount local file as a Volume to containers??
</p>
</div>
</div>

<div id="outline-container-org1ae1d2f" class="outline-4">
<h4 id="org1ae1d2f"><a href="https://kubernetes.io/docs/tasks/configure-pod-container/configure-pod-configmap/">Configure a Pod to Use a ConfigMap</a></h4>
<div class="outline-text-4" id="text-org1ae1d2f">
</div><ul class="org-ul"><li><a id="org128176f"></a>Overview<br><div class="outline-text-5" id="text-org128176f">
<ul class="org-ul">
<li>ConfigMap act as register table.</li>
<li>Can be create from file, directory</li>
<li>ConfigMap's value can be used by Pods as volume mount or command substitutioin</li>
</ul>
</div></li>

<li><a id="org16132a0"></a>Create a ConfigMap<br><div class="outline-text-5" id="text-org16132a0">
<ul class="org-ul">
<li>use <code>kubectl create configmap &lt;map-name&gt; &lt;data-source&gt;</code> to create configmaps</li>
<li>can based from directories, files or literal values</li>
<li>parameters of <code>--from-file</code> can be directories or files</li>
<li><code>--from-env-file</code> can load property file's content</li>
<li><code>--from-file</code> can be formed as <code>key=path</code>, key will be acted as <code>&lt;path-to-file&gt;</code></li>
<li><code>--from-literal</code> can be passed multple times to specific key-value pairs</li>
</ul>
</div></li>

<li><a id="orgba06e9b"></a>Define container environment variables using ConfigMap data<br><div class="outline-text-5" id="text-orgba06e9b">
<ol class="org-ol">
<li>First create ConfigMap <code>special-config</code> with kv pair <code>special.how=&lt;value&gt;</code></li>
<li><p>
Create Pod with settings looks like (env <code>SPECIAL_LEVEL_KEY</code> will be replaces with ConfigMap's <code>&lt;value&gt;</code> of <code>special.how</code>)
</p>
<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: Pod
metadata:
  name: dapi-test-pod
spec:
  containers:
    - name: test-container
      image: k8s.gcr.io/busybox
      command: [ "/bin/sh", "-c", "env" ]
      env:
	# Define the environment variable
	- name: SPECIAL_LEVEL_KEY
	  valueFrom:
	    configMapKeyRef:
	      # The ConfigMap containing the value you want to assign to SPECIAL_LEVEL_KEY
	      name: special-config
	      # Specify the key associated with the value
	      key: special.how
  restartPolicy: Never
</pre>
</div></li>
</ol>
</div></li>

<li><a id="orgace8339"></a>Configure all key-value pairs in a ConfigMap as container environment variables<br><div class="outline-text-5" id="text-orgace8339">
<p>
Use <code>envFrom</code> to define all of the ConfigMap's data as container environment variables
</p>

<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: Pod
metadata:
  name: dapi-test-pod
spec:
  containers:
    - name: test-container
      image: k8s.gcr.io/busybox
      command: [ "/bin/sh", "-c", "env" ]
      envFrom:
      - configMapRef:
	  name: special-config
  restartPolicy: Never
</pre>
</div>
</div></li>

<li><a id="org16dd69b"></a>Use ConfigMap-defined environment variables in Pod commands<br><div class="outline-text-5" id="text-org16dd69b">
<p>
Like shell variable substitutioin syntax, use <code>$(VAR_NAME)</code>. For example
</p>

<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: Pod
metadata:
  name: dapi-test-pod
spec:
  containers:
    - name: test-container
      image: k8s.gcr.io/busybox
      command: [ "/bin/sh", "-c", "echo $(SPECIAL_LEVEL_KEY) $(SPECIAL_TYPE_KEY)" ]
      env:
	- name: SPECIAL_LEVEL_KEY
	  valueFrom:
	    configMapKeyRef:
	      name: special-config
	      key: SPECIAL_LEVEL
	- name: SPECIAL_TYPE_KEY
	  valueFrom:
	    configMapKeyRef:
	      name: special-config
	      key: SPECIAL_TYPE
  restartPolicy: Never
</pre>
</div>
</div></li>
