cloud/kubernetes/tutorial.org
**** Add ConfigMap data to Volume

- Act as volume backend
- Mount volume to =volumeMounts.mountPath=
- Set =key= and =path= to a specific path in the Volume


For example

#+BEGIN_SRC yaml
  apiVersion: v1
  kind: Pod
  metadata:
    name: dapi-test-pod
  spec:
    containers:
      - name: test-container
        image: k8s.gcr.io/busybox
        command: [ "/bin/sh", "-c", "ls /etc/config/" ]
        volumeMounts:
        - name: config-volume
          mountPath: /etc/config
    volumes:
      - name: config-volume
        configMap:
          # Provide the name of the ConfigMap containing the files you want
          # to add to the container
          name: special-config
    restartPolicy: Never
#+END_SRC
#+BEGIN_SRC yaml
  apiVersion: v1
  kind: Pod
  metadata:
    name: dapi-test-pod
  spec:
    containers:
      - name: test-container
        image: k8s.gcr.io/busybox
        command: [ "/bin/sh","-c","cat /etc/config/keys" ]
        volumeMounts:
        - name: config-volume
          mountPath: /etc/config
    volumes:
      - name: config-volume
        configMap:
          name: special-config
          items:
          - key: special.level
            path: keys            # mount file `/etc/config/keys` with contents of value of `special.level`
    restartPolicy: Never
#+END_SRC
**** Understand ConfigMaps and Pods

- ConfigMaps act as register table (key-value pairs storage)
- ConfigMaps can be consumed in pods (act as configuration for example)
- Must be created before using by Pods
- ConfigMaps reside in a specific namespace, so Pods use ConfigMaps must be in the same namespace

**** Note
   
- ConfigMap can be created use specification looks like these
  #+BEGIN_SRC yaml
    apiVersion: v1
    kind: ConfigMap
    metadata:
      name: special-config
      namespace: default
    data:
      special.how: very
  #+END_SRC
- When mount ConfigMap Volume to a mountpoint, other files under the mountpoint will be deleted!
- Mounted ConfigMaps are updated automatically in period

* [[https://kubernetes.io/docs/tutorials/stateless-application/expose-external-ip-address/][Stateless Applications]]

** Steps

1. Use =kubectl run= with =--replicas= parameter to specific pods count
   #+BEGIN_SRC bash
     kubectl run hello-world --replicas=5 --labels="run=load-balancer-example" --image=gcr.io/google-samples/node-hello:1.0  --port=8080
   #+END_SRC
2. Display deploy information
   #+BEGIN_SRC bash
     kubectl get deployments hello-world
     kubectl describe deployments hello-world
   #+END_SRC
3. Display ReplicaSet objects
   #+BEGIN_SRC bash
     kubectl get replicasets
     kubectl describe replicasets
   #+END_SRC
4. Create Service
   #+BEGIN_SRC bash
     kubectl expose deployment hello-world --type=LoadBalancer --name=my-service
   #+END_SRC
5. Display service 
   #+BEGIN_SRC bash
   kubectl get services my-service
   kubectl describe services my-service
   #+END_SRC
6. Use service
7. Cleanup
   #+BEGIN_SRC bash
     kubectl delete services my-services
     kubectl delete deployment hello-world
   #+END_SRC

** Deployments

See [[file:k8s.org::*Deployments][Concept/Deployments]]

** Note

* Useful commands

** version

** cluster-info
** get
- =-l= option to select label
*** nodes
*** pods
*** deployment
*** events
** run
** create
*** configmap
** TODO logs
** exec

Execute bash on the pod/container (seems to be useful for debug)

#+BEGIN_SRC bash
kubectl exec -it $POD_NAME bash
#+END_SRC
** label
** delete
** rollout
*** undo
*** status
* Problem

** TODO Difference between =kubectl apply= and =kubectl create=
