kubernetes/tutorial.html

<li><a id="orgf1ab252"></a>Add ConfigMap data to Volume<br><div class="outline-text-5" id="text-orgf1ab252">
<ul class="org-ul">
<li>Act as volume backend</li>
<li>Mount volume to <code>volumeMounts.mountPath</code></li>
<li>Set <code>key</code> and <code>path</code> to a specific path in the Volume</li>
</ul>


<p>
For example
</p>

<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: Pod
metadata:
  name: dapi-test-pod
spec:
  containers:
    - name: test-container
      image: k8s.gcr.io/busybox
      command: [ "/bin/sh", "-c", "ls /etc/config/" ]
      volumeMounts:
      - name: config-volume
	mountPath: /etc/config
  volumes:
    - name: config-volume
      configMap:
	# Provide the name of the ConfigMap containing the files you want
	# to add to the container
	name: special-config
  restartPolicy: Never
</pre>
</div>
<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: Pod
metadata:
  name: dapi-test-pod
spec:
  containers:
    - name: test-container
      image: k8s.gcr.io/busybox
      command: [ "/bin/sh","-c","cat /etc/config/keys" ]
      volumeMounts:
      - name: config-volume
	mountPath: /etc/config
  volumes:
    - name: config-volume
      configMap:
	name: special-config
	items:
	- key: special.level
	  path: keys            # mount file `/etc/config/keys` with contents of value of `special.level`
  restartPolicy: Never
</pre>
</div>
</div></li>
<li><a id="org7ea8f94"></a>Understand ConfigMaps and Pods<br><div class="outline-text-5" id="text-org7ea8f94">
<ul class="org-ul">
<li>ConfigMaps act as register table (key-value pairs storage)</li>
<li>ConfigMaps can be consumed in pods (act as configuration for example)</li>
<li>Must be created before using by Pods</li>
<li>ConfigMaps reside in a specific namespace, so Pods use ConfigMaps must be in the same namespace</li>
</ul>
</div></li>

<li><a id="orgae7bddd"></a>Note<br><div class="outline-text-5" id="text-orgae7bddd">
<ul class="org-ul">
<li><p>
ConfigMap can be created use specification looks like these
</p>
<div class="org-src-container">
<pre class="src src-yaml">apiVersion: v1
kind: ConfigMap
metadata:
  name: special-config
  namespace: default
data:
  special.how: very
</pre>
</div></li>
<li>When mount ConfigMap Volume to a mountpoint, other files under the mountpoint will be deleted!</li>
<li>Mounted ConfigMaps are updated automatically in period</li>
</ul>
</div></li></ul>
</div>
</div>
</div>

<div id="outline-container-orge7698c7" class="outline-2">
<h2 id="orge7698c7">Useful commands</h2>
<div class="outline-text-2" id="text-orge7698c7">
</div><div id="outline-container-orgd95f71c" class="outline-3">
<h3 id="orgd95f71c">version</h3>
</div>

<div id="outline-container-org114d925" class="outline-3">
<h3 id="org114d925">cluster-info</h3>
</div>
<div id="outline-container-org41c95dc" class="outline-3">
<h3 id="org41c95dc">get</h3>
<div class="outline-text-3" id="text-org41c95dc">
<ul class="org-ul">
<li><code>-l</code> option to select label</li>
</ul>
</div>
<div id="outline-container-orgafeb9f9" class="outline-4">
<h4 id="orgafeb9f9">nodes</h4>
</div>
<div id="outline-container-orge482416" class="outline-4">
<h4 id="orge482416">pods</h4>
</div>
<div id="outline-container-org765b14a" class="outline-4">
<h4 id="org765b14a">deployment</h4>
</div>
<div id="outline-container-orgff80dc7" class="outline-4">
<h4 id="orgff80dc7">events</h4>
</div>
</div>
<div id="outline-container-orgfbc01f9" class="outline-3">
<h3 id="orgfbc01f9">run</h3>
</div>
<div id="outline-container-orgf94e817" class="outline-3">
<h3 id="orgf94e817">create</h3>
<div class="outline-text-3" id="text-orgf94e817">
</div><div id="outline-container-orge13d4b6" class="outline-4">
<h4 id="orge13d4b6">configmap</h4>
</div>
</div>
<div id="outline-container-org45a1fcd" class="outline-3">
<h3 id="org45a1fcd"><span class="todo TODO">TODO</span> logs</h3>
</div>
<div id="outline-container-org607cf7b" class="outline-3">
<h3 id="org607cf7b">exec</h3>
<div class="outline-text-3" id="text-org607cf7b">
<p>
Execute bash on the pod/container (seems to be useful for debug)
</p>

<div class="org-src-container">
<pre class="src src-bash">kubectl exec $POD_NAME bash
</pre>
</div>
</div>
</div>
<div id="outline-container-org3695b80" class="outline-3">
<h3 id="org3695b80">label</h3>
</div>
<div id="outline-container-orgb645fe4" class="outline-3">
<h3 id="orgb645fe4">delete</h3>
</div>
<div id="outline-container-orgaa0606c" class="outline-3">
<h3 id="orgaa0606c">rollout</h3>
<div class="outline-text-3" id="text-orgaa0606c">
</div><div id="outline-container-org888d641" class="outline-4">
<h4 id="org888d641">undo</h4>
</div>
<div id="outline-container-orgf1277f0" class="outline-4">
<h4 id="orgf1277f0">status</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2018-09-13 四 20:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
